#include <stdio.h>
#include <assert.h>

/*
    如果 x 的位级表示有奇数个 1，返回 1，其它情况返回 0。

    偶数个 1 异或结果为 0，奇数个 1 异或结果为 1，且异或操作可结合。
    使用移位将各个位异或的结果保存到 B0 再与 1 即可。

    例： 10011110
        1. x ^= x >> 4    10011110 ^ 00001001 = 1  0  0  1  0  1  1  1
                                                |  |  |  |  |  |  |  |       
                                                7  6  5  4  37 26 15 04    <- 数字表示保存对应位中 1 的个数的奇偶性，37 表示 B3 和 B7 中 1 的个数的奇偶性。
        2. x ^= x >> 2    10010111 ^ 00100101 = 1    0    1    1    0    0    1    0
                                                |    |    |    |    |    |    |    |
                                                7    6   57   46   357  246  1357 0246
        3. x ^= x >> 1    10110010 ^ 01011001 = 1      0      1      1      0      0      1      0
                                                |      |      |      |      |      |      |      |
                                                7     67     567    4567   34567 234567 1234567 01234567
*/  
int odd_ones(unsigned x)
{
    x ^= x >> 16;
    x ^= x >> 8;
    x ^= x >> 4;
    x ^= x >> 2;
    x ^= x >> 1;
    return x & 1;
}

int main(int argc, char *argv[])
{
    assert(odd_ones(0x10101011));
    assert(!odd_ones(0x01010101));
    return 0;
}
